Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>multiformats</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.this["java-multiaddr/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "java-multiaddr"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["java-multibase/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "java-multibase"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["java-multihash/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "java-multihash"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-blake2/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-blake2"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-multiformats/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-multiformats"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-sha3/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-sha3"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["multiaddr/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "multiaddr"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["rust-cid/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "rust-cid"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["rust-multiaddr/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "rust-multiaddr"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["rust-multibase/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "rust-multibase"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["rust-multihash/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "rust-multihash"
      + sha                 = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->